
//-------------------------------------------------------------------------
//转换整数为字符串
//-------------------------------------------------------------------------
void bcd2str32(uint32_t n, char *pc)
{
	uint32_t nTemp;
	uint_t i;

	pc += 7;
	for (i = 8; i; i--) {
		nTemp = n & 0x0F;
		if (nTemp <= 0x09)
			/* Add 0x30 to its ascii */
			*pc-- = nTemp + 0x30;
		else
			/* Add 0x37 to its ascii */
			*pc-- = nTemp + 0x37;
		n >>= 4;
	}
}

//-------------------------------------------------------------------------
//转换整数为字符串
//-------------------------------------------------------------------------
void int2str32(uint32_t n, char *pc)
{

	bcd2str32(bin2bcd32(n), pc);
}

//-------------------------------------------------------------------------
//转换整数为字符串
//-------------------------------------------------------------------------
void bcd2str16(uint_t n, char *pc)
{
	uint_t nTemp, i;

	pc += 3;
	for (i = 4; i; i--) {
		nTemp = n & 0x0F;
		if (nTemp <= 0x09)
			/* Add 0x30 to its ascii */
			*pc-- = nTemp + 0x30;
		else
			/* Add 0x37 to its ascii */
			*pc-- = nTemp + 0x37;
		n >>= 4;
	}
}

//-------------------------------------------------------------------------
//转换整数为字符串
//-------------------------------------------------------------------------
void bcd2str8(uint_t n, char *pc)
{
	uint_t nTemp, i;

	pc += 1;
	for (i = 2; i; i--) {
		nTemp = n & 0x0F;
		if (nTemp <= 0x09)
			/* Add 0x30 to its ascii */
			*pc-- = nTemp + 0x30;
		else
			/* Add 0x37 to its ascii */
			*pc-- = nTemp + 0x37;
		n >>= 4;
	}
}

//-------------------------------------------------------------------------
//字符串是否全为某值
//-------------------------------------------------------------------------
int memtest(const void *s, int c, int len)
{
	uint_t i;
	uint8_t *p = (uint8_t *)s;

	for (i = len; i; i--)
		if (*p++ != c)
			break;
	return i;
}



